<template>
  <v-row align="center" justify="center">
    <v-col class="text-center" cols="12">
      <h1 class="text-h4 font-weight-thin mb-4">更新于 2022.10.19</h1>
      <h4>嘿 欢迎来到这里！</h4>
    </v-col>
    <h1 class="float-left">关于我</h1>
    <div class="text-h6 font-weight">
      我是~刘翔華(huā)~，可以叫我華子，朋友都这么叫我的。关于我的名字，的确是繁体字。<br />

      <br />哈哈，可能你会很好奇，为什么繁体字也可以上名字呢？<br />确实，从小到大我经常被问到这个问题。坦诚的说，我算是祖籍台湾的福建人啦，从我曾祖父那一辈就定居在了台湾的对面"福州"。<br />我是曾祖父那辈从台湾迁到福建的，其实我还算是个客家人呢。当时我爷爷的爸爸来到福建闽西一带"龙岩"，这一片北上瑞金，南下梅州，只要一个山头的距离。聚集着许许多多的客家人，同样这一片也是红军的重要革命根据地。后来国家太平后，我听我爷爷说，曾祖父当时还是我们村的村长，奈何文化不够，只会打战和唱军歌，慢慢的就退下来了。后来后来很久，我出生了，这是曾祖父已经不在了，爷爷说想要保留一下我们的传统（名字繁体）就像新疆人名字”扎西·祥林“中间有个点一样，但是当时全国推行简体字，没办法全部名字都是繁体，只能把华变成華了。
    </div>
    <h1 class="float-left">关于以前</h1>
    <div class="text-h6 font-weight">
      我喜欢打游戏(现在很少打了，以前喜欢打王者荣耀)，以前我算是非常叛逆的网瘾少年。在福州享受个还算不错的教育资源，一盘好棋被我下坏了。从初1开始到高3，6年的时间，我天天在打游戏。不记得离家出走过几次，去过几回黑网吧，打过几次架，又什么时候把老师柜子砸了。在17岁的时候把，中专上完了（以我成绩可以说是没有书读的，一番操作后去到安徽读中专。），在家人一次聚餐中，老爸突然给我算起了培养我的成本，几分钟后列出一堆账单，十几个W。。。后面想想确实是这样的，那天我一直到凌晨3点才睡着。我突然发现游戏好像没有那么吸引我了，我也想好好学习，想看到家人为我骄傲的样子。自此，我发愤图强，每天都会学习，背单词。当时只为了考一个本科学历（自考），后来老爸到处给我打听上大学的渠道，好巧不巧，国家正在推行高职扩招一政策。于是我来到了江苏一大专院校(江苏财经职业技术学院)。我非常感谢国家，也非常感谢学校能收留我。自我到学校开始，我便每日疯狂的学习，背单词，刷高数，学编程。我好像感觉到了以前捉摸不到的青春，是那种努力、向上、自由的感觉，我非常享受，我第一次这么喜欢学习，我还竞争了班级学习委员一职，加入了中国共青团，我感觉生活越来越美好了，日子有了盼头。
    </div>
    <h1 class="float-left">关于现在</h1>
    <div class="text-h6 font-weight">
      这段写完的话，可能我的毕设就已经搞定了。这是我博客最后一个页面了，我很早便想弄一个博客了，在我github中19年我就新建了一个博客项目，但是没有后来，烂尾了。等我把它部署到服务器以后呢，我可能就会很清闲了。在学校我已经拿了很多奖，英语四级和计算机二级也已经过了，没有东西能束缚我了（除了感情）。说实话我不太明白为什么学校要这么早给我安排毕业设计，我不太理解，虽说我班级是归于20级的，可是我们都是21年才入学的，都是24年才毕业，就算项目做完也得要很久以后才会进行答辩，罢了，反正我已经做完了。距离六级考试还有些时间，我想这段时间可以疯狂地训练我的体能了，我希望我的3公里可以跑进11分钟。目前我的跑步pb是：3公里12:07，五公里:21:30。糟糕！现在是2022年10月19号周三，下周一我就要军训了！我的清闲日子不多了！珍惜现在！！！待我在写一段我就去跑步！
    </div>
    <h1 class="float-left">关于未来</h1>
    <div class="text-h6 font-weight">
      我对未来的筹备做了好久好久，我想通过专转本考入"南京信息工程大学"，然后在本科期间参军2年(我爷爷非常希望我去当兵，贡献自己保家卫国。)，接着通过退伍军人的身份加入考研大军。我自认为我的脑袋瓜不比别人差，所以我一直努力学习，不仅仅是不想仅限于大专（没有说学校不好的意思，我很爱我的学校，再次为他打下广告:江苏财经职业技术学院，江苏大专小清华！！），也是想要去证明一下我自己，更是想让我的家人为我骄傲。以前的同学大部分都在双一流和一本了，部分也有在985211的。但是我已经很少和他们联系了，学历之间的差距已经把我们之间设下了一条鸿沟。所以这也是我为何如此努力学习的原因，我朋友都说如果我按正常的学习轨迹走的话我至少会在一个本科学院度过我的大学生活。我也这么认为，我所有知识都是自学的，在6年没有学过一分钟的情况下，在我基础无比薄弱的情况下，我一次性通过了英语四级，计算机二级Python，浅学了几轮高数。我想我脑袋是不比别人差的，关于这个博客也是我全部自己一个人研究的，没有人帮助我。<br />
      博客前台我采用的技术是 Vue+Vuetify，博客后台是Vue+Element，数据库是Mysql，后端是Python+Django+Drf，现在功能不多，但是所有代码，全是我挑灯而写，所有技术栈，都是我在图书馆熬过来的。这只是第一代的版本，后续我会慢慢添加需要的功能。
      <br />
    </div>
    <h1 class="float-left">关于感谢</h1>
    <div class="text-h6 font-weight">
      谁也不感谢了，就感谢我自己，写代码好累，我好牛蛙！(开玩笑)
      <br />感谢国家的高职扩招政策给我接收高等教育的机会。感谢江苏财经职业技术学院对我的培养。感谢黑马程序员给我提供相关技术栈的视频。感觉傅伟玉论文老师对我的指导。感谢宿管阿姨对我的关心。感谢图书馆的各位同学认真学习给我提供学习的氛围。感谢我的父母能让我无忧无虑的学习。感谢我自己，感谢我自己，感谢我自己！我们各位以后更高处想见可好？
    </div>
  </v-row>
</template>
<script>
export default {}
</script>

<style></style>
